In [2]:
import pandas as pd

fileptah = r'I:\Data\Personal Data\graduation project\yuzhongzhan\52983-1989-2021.FSL'

In [3]:
data = pd.read_table(fileptah,sep='\s+',names=['0','1','2','3','4','5','6'])
data.head(10)

     0      1      2      3      4        5        6
0  254      0      1    JAN   1989      NaN      NaN
1    1  52983  52983    34N   109E      0.0   2303.0
2    2    500    500    500     22  99999.0      3.0
3    3   HAKJ  99999     ms    NaN      NaN      NaN
4    9  10000  -2691  99999  99999  99999.0  99999.0
5    4   8500  -1461  99999  99999  99999.0  99999.0
6    4   7160      0   -145   -170      0.0      0.0
7    4   7000    172   -137   -164    340.0     10.0
8    4   5000   2740   -270   -330    270.0    154.0
9    4   4000   4350   -339   -409    275.0    195.0

In [11]:
row = 0
while row <900:
    if(data.iloc[row,0] == 254):
        # 查找对应的年份
        print(data.iloc[row,])
    row = row + 1

0     254
1      12
2       3
3     FEB
4    1989
5     NaN
6     NaN
Name: 1314, dtype: object
0     254
1       0
2       4
3     FEB
4    1989
5     NaN
6     NaN
Name: 1336, dtype: object
0     254
1      12
2       4
3     FEB
4    1989
5     NaN
6     NaN
Name: 1357, dtype: object
0     254
1       0
2       5
3     FEB
4    1989
5     NaN
6     NaN
Name: 1378, dtype: object
0     254
1      12
2       5
3     FEB
4    1989
5     NaN
6     NaN
Name: 1397, dtype: object
0     254
1       0
2       6
3     FEB
4    1989
5     NaN
6     NaN
Name: 1418, dtype: object
0     254
1      12
2       6
3     FEB
4    1989
5     NaN
6     NaN
Name: 1441, dtype: object
0     254
1       0
2       7
3     FEB
4    1989
5     NaN
6     NaN
Name: 1463, dtype: object
0     254
1      12
2       7
3     FEB
4    1989
5     NaN
6     NaN
Name: 1484, dtype: object
0     254
1       0
2       8
3     FEB
4    1989
5     NaN
6     NaN
Name: 1505, dtype: object
0     254
1      12
2       8
3     FEB
4    1989
5     NaN
6     NaN
Name: 1527, dtype: object
0     254
1       0
2       9
3     FEB
4    1989
5     NaN
6     NaN
Name: 1548, dtype: object
0     254
1      12
2       9
3     FEB
4    1989
5     NaN
6     NaN
Name: 1568, dtype: object
0     254
1       0
2      10
3     FEB
4    1989
5     NaN
6     NaN
Name: 1590, dtype: object
0     254
1      12
2      10
3     FEB
4    1989
5     NaN
6     NaN
Name: 1611, dtype: object
0     254
1      18
2      10
3     FEB
4    1989
5     NaN
6     NaN
Name: 1627, dtype: object
0     254
1       0
2      11
3     FEB
4    1989
5     NaN
6     NaN
Name: 1643, dtype: object
0     254
1      12
2      11
3     FEB
4    1989
5     NaN
6     NaN
Name: 1664, dtype: object
0     254
1       0
2      12
3     FEB
4    1989
5     NaN
6     NaN
Name: 1685, dtype: object
0     254
1      12
2      12
3     FEB
4    1989
5     NaN
6     NaN
Name: 1704, dtype: object
0     254
1       0
2      13
3     FEB
4    1989
5     NaN
6     NaN
Name: 1726, dtype: object
0     254
1      12
2      13
3     FEB
4    1989
5     NaN
6     NaN
Name: 1747, dtype: object
0     254
1       0
2      14
3     FEB
4    1989
5     NaN
6     NaN
Name: 1770, dtype: object
0     254
1      12
2      14
3     FEB
4    1989
5     NaN
6     NaN
Name: 1790, dtype: object
0     254
1       0
2      15
3     FEB
4    1989
5     NaN
6     NaN
Name: 1812, dtype: object
0     254
1      12
2      15
3     FEB
4    1989
5     NaN
6     NaN
Name: 1831, dtype: object
0     254
1       0
2      16
3     FEB
4    1989
5     NaN
6     NaN
Name: 1852, dtype: object
0     254
1      12
2      16
3     FEB
4    1989
5     NaN
6     NaN
Name: 1873, dtype: object
0     254
1       0
2      17
3     FEB
4    1989
5     NaN
6     NaN
Name: 1894, dtype: object